---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDistance
source: html/8f89db2b-e073-8357-3064-104057588292.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDistance Property

"Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDistance { get; }
```